In [6]:
import pandas as pd

In [7]:
info={
    "Name":["Pooja","Chirashwi","Charishma"],
    "CGPA":[9.3,9.6,8.4]
}
df=pd.DataFrame(info)
print(df)

        Name  CGPA
0      Pooja   9.3
1  Chirashwi   9.6
2  Charishma   8.4

In [8]:
df

        Name  CGPA
0      Pooja   9.3
1  Chirashwi   9.6
2  Charishma   8.4

In [11]:
s=pd.Series([1,2,3,4,5])
print(s)
print(type(s))

#Access the values in series done by 2 methods (index ans label)
#index
print(s[0])
print(s[3])

#label

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>
1
4

In [23]:
s=pd.Series([28,23,26,25],index=["Steve","Eleven","Lucus","Dustin"])
print(s)

print(s["Dustin"])
print(s["Steve"])
 #print(s[0])  gives warning to use iloc 
print(s.index)

Steve     28
Eleven    23
Lucus     26
Dustin    25
dtype: int64
25
28
Index(['Steve', 'Eleven', 'Lucus', 'Dustin'], dtype='object')

In [27]:
#Properties 
#homogenous
s=pd.Series([28,23,26,25,"Mike"],index=["Steve","Eleven","Lucus","Dustin",25])
print(s)

print(s["Dustin"])
print(s["Steve"])

Steve       28
Eleven      23
Lucus       26
Dustin      25
25        Mike
dtype: object
25
28

In [32]:
#properties
#vectorization 
s1=pd.Series([1,2,3,4,5])
s2=pd.Series([3,2,3,4,5])
print(s1+s2)

#Mutable values
s1[0]=65
print(s1)

#size of series is immutable
changed_s1=s1.drop(0)

print(s1)
print(changed_s1)

0     4
1     4
2     6
3     8
4    10
dtype: int64
0    65
1     2
2     3
3     4
4     5
dtype: int64
0    65
1     2
2     3
3     4
4     5
dtype: int64
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
#DataFrame
import pandas as pd

info={
    "Name":["Steve","Nancy","Max"],
    "Age":[29,28,24],
    "CGPA":[9.5,8.0,7.0]
}

df=pd.DataFrame(info)
print(df,type(df))

    Name  Age  CGPA
0  Steve   29   9.5
1  Nancy   28   8.0
2    Max   24   7.0 <class 'pandas.core.frame.DataFrame'>

In [3]:
df

    Name  Age  CGPA
0  Steve   29   9.5
1  Nancy   28   8.0
2    Max   24   7.0

In [8]:
print(df.index) #row value
print(df.columns)

RangeIndex(start=0, stop=3, step=1)
RangeIndex(start=0, stop=2, step=1)

In [9]:
#DataFrame is list of list

df=pd.DataFrame([["Steve",29],["Nancy",28],["Max",24]],columns=["Name","age"])
print(df)

    Name  age
0  Steve   29
1  Nancy   28
2    Max   24

In [3]:
#creating Datafrrame by numpy array
import numpy as np
import pandas as pd

np_arr=np.array([[1,2,3],[4,5,6]])
df=pd.DataFrame(np_arr,columns=["P","Q","R"])
print(df)

   P  Q  R
0  1  2  3
1  4  5  6

In [4]:
#csv 
df=pd.read_csv("employee_data.csv")
print(df,type(df))

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000 <class 'pandas.core.frame.DataFrame'>

In [5]:
#json 
df=pd.read_json("data_data.json")
print(df,type(df))

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000 <class 'pandas.core.frame.DataFrame'>

In [8]:
#dataframe methods
df.head()  #gives first 5 rows

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000

In [9]:
df.tail() #gives last 5 rows

   ID    Name  Age Department  Salary
5   6   Frank   29    Finance   50000
6   7   Grace   41         HR   82000
7   8  Hannah   26  Marketing   47000
8   9     Ian   35         IT   75000
9  10   Julia   30    Finance   60000

In [10]:
df.head(2)

   ID   Name  Age Department  Salary
0   1  Alice   25         HR   55000
1   2    Bob   32         IT   72000

In [11]:
df.tail(4)

   ID    Name  Age Department  Salary
6   7   Grace   41         HR   82000
7   8  Hannah   26  Marketing   47000
8   9     Ian   35         IT   75000
9  10   Julia   30    Finance   60000

In [12]:
df.sample() #gives random sample

   ID   Name  Age Department  Salary
9  10  Julia   30    Finance   60000

In [14]:
df.sample(3)

   ID     Name  Age Department  Salary
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
9  10    Julia   30    Finance   60000

In [15]:
df.info() #gives summary of data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          10 non-null     int64
 1   Name        10 non-null     object
 2   Age         10 non-null     int64
 3   Department  10 non-null     object
 4   Salary      10 non-null     int64
dtypes: int64(3), object(2)
memory usage: 532.0+ bytes

In [17]:
df.shape #row,col

(10, 5)

In [18]:
df.describe() #

             ID        Age        Salary
count  10.00000  10.000000     10.000000
mean    5.50000  32.900000  64500.000000
std     3.02765   6.674162  15182.226451
min     1.00000  25.000000  47000.000000
25%     3.25000  28.250000  51250.000000
50%     5.50000  31.000000  62500.000000
75%     7.75000  37.250000  74250.000000
max    10.00000  45.000000  91000.000000

In [20]:
df.columns

Index(['ID', 'Name', 'Age', 'Department', 'Salary'], dtype='object')

In [22]:
df.nunique()

ID            10
Name          10
Age           10
Department     4
Salary        10
dtype: int64